tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nodenv/nodenv"
tap "rcmdnk/file"
brew "bat"
brew "direnv"
brew "exa"
brew "fish"
brew "fisher"
brew "gh"
brew "ghq"
brew "graphviz"
brew "mas"
brew "neovim"
brew "node-build"
brew "nodenv"
brew "peco"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "nodenv/nodenv/nodenv-nvmrc"
cask "1password"
cask "android-studio"
cask "charles"
cask "cleanmymac"
cask "cmd-eikana"
cask "discord"
cask "docker"
cask "iterm2"
cask "moom"
cask "logitech-options"
cask "raycast"
cask "slack"
cask "ticktick"
cask "visual-studio-code"
