tap "grishka/grishka"
tap "homebrew/bundle"
tap "nodenv/nodenv"
tap "rcmdnk/file"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Load/unload environment variables based on $PWD
brew "direnv"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern, maintained replacement for ls
brew "eza"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Simplistic interactive filtering tool
brew "peco"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pick a node version from .nvmrc
brew "nodenv/nodenv/nodenv-nvmrc"
# Tools for building Android applications
cask "android-studio"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
cask "font-firgenerd"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility to move and zoom windows—on one display
cask "moom"
# Unofficial Google Nearby Share app
cask "neardrop"
# Open-source code editor
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Slack", id: 803453959
mas "TickTick", id: 966085870
mas "Xcode", id: 497799835
