tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nodenv/nodenv"
tap "rcmdnk/file"
brew "bat"
brew "blueutil"
brew "exa"
brew "fish"
brew "gh"
brew "ghq"
brew "git"
brew "graphviz"
brew "lima"
brew "mas"
brew "neovim"
brew "node-build"
brew "nodenv"
brew "nvm"
brew "peco"
brew "tmux"
brew "vim"
brew "nodenv/nodenv/nodenv-nvmrc"
cask "android-studio"
cask "charles"
cask "cleanmymac"
cask "clipy"
cask "discord"
cask "docker"
cask "google-japanese-ime"
cask "iterm2"
cask "krisp"
cask "moom"
cask "visual-studio-code"
cask "zeplin"
mas "1Password 7", id: 1333542190
mas "DevCleaner", id: 1388020431
mas "Keynote", id: 409183694
mas "Slack", id: 803453959
mas "TickTick", id: 966085870
mas "Xcode", id: 497799835
